ciaa/firmware_v1/externals/drivers/msp430/inc/msp430fr5727.h
/* Additional Timer B Control Register bits are defined in Timer A */
/* TBxCCTLx Control Bits */
#define CLLD1               (0x0400)  /* Compare latch load source 1 */
#define CLLD0               (0x0200)  /* Compare latch load source 0 */

#define SLSHR1              (0x0400)  /* Compare latch load source 1 */
#define SLSHR0              (0x0200)  /* Compare latch load source 0 */

#define SLSHR_0             (0x0000) /* Compare latch load sourec : 0 - immediate */
#define SLSHR_1             (0x0200) /* Compare latch load sourec : 1 - TBR counts to 0 */
#define SLSHR_2             (0x0400) /* Compare latch load sourec : 2 - up/down */
#define SLSHR_3             (0x0600) /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

#define CLLD_0              (0x0000) /* Compare latch load sourec : 0 - immediate */
#define CLLD_1              (0x0200) /* Compare latch load sourec : 1 - TBR counts to 0 */
#define CLLD_2              (0x0400) /* Compare latch load sourec : 2 - up/down */
#define CLLD_3              (0x0600) /* Compare latch load sourec : 3 - TBR counts to TBCTL0 */

/* TBxEX0 Control Bits */
#define TBIDEX0             (0x0001)   /* Timer0_B7 Input divider expansion Bit: 0 */
#define TBIDEX1             (0x0002)   /* Timer0_B7 Input divider expansion Bit: 1 */
#define TBIDEX2             (0x0004)   /* Timer0_B7 Input divider expansion Bit: 2 */

#define TBIDEX_0            (0x0000) /* Timer0_B7 Input divider expansion : /1 */
#define TBIDEX_1            (0x0001) /* Timer0_B7 Input divider expansion : /2 */
#define TBIDEX_2            (0x0002) /* Timer0_B7 Input divider expansion : /3 */
#define TBIDEX_3            (0x0003) /* Timer0_B7 Input divider expansion : /4 */
#define TBIDEX_4            (0x0004) /* Timer0_B7 Input divider expansion : /5 */
#define TBIDEX_5            (0x0005) /* Timer0_B7 Input divider expansion : /6 */
#define TBIDEX_6            (0x0006) /* Timer0_B7 Input divider expansion : /7 */
#define TBIDEX_7            (0x0007) /* Timer0_B7 Input divider expansion : /8 */
#define TBIDEX__1           (0x0000) /* Timer0_B7 Input divider expansion : /1 */
#define TBIDEX__2           (0x0001) /* Timer0_B7 Input divider expansion : /2 */
#define TBIDEX__3           (0x0002) /* Timer0_B7 Input divider expansion : /3 */
#define TBIDEX__4           (0x0003) /* Timer0_B7 Input divider expansion : /4 */
#define TBIDEX__5           (0x0004) /* Timer0_B7 Input divider expansion : /5 */
#define TBIDEX__6           (0x0005) /* Timer0_B7 Input divider expansion : /6 */
#define TBIDEX__7           (0x0006) /* Timer0_B7 Input divider expansion : /7 */
#define TBIDEX__8           (0x0007) /* Timer0_B7 Input divider expansion : /8 */

/* TB0IV Definitions */
#define TB0IV_NONE          (0x0000)    /* No Interrupt pending */
#define TB0IV_TBCCR1        (0x0002)    /* TB0CCR1_CCIFG */
#define TB0IV_TBCCR2        (0x0004)    /* TB0CCR2_CCIFG */
#define TB0IV_3             (0x0006)    /* Reserved */
#define TB0IV_4             (0x0008)    /* Reserved */
#define TB0IV_5             (0x000A)    /* Reserved */
#define TB0IV_6             (0x000C)    /* Reserved */
#define TB0IV_TBIFG         (0x000E)    /* TB0IFG */

/* Legacy Defines */
#define TB0IV_TB0CCR1       (0x0002)    /* TB0CCR1_CCIFG */
#define TB0IV_TB0CCR2       (0x0004)    /* TB0CCR2_CCIFG */
#define TB0IV_TB0IFG        (0x000E)    /* TB0IFG */


/************************************************************
* Timer1_B3
************************************************************/
#define __MSP430_HAS_T1B3__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_T1B3__ 0x0400
#define TIMER_B1_BASE __MSP430_BASEADDRESS_T1B3__

#define TB1CTL_               0x0400    /* Timer1_B3 Control */
sfrw(TB1CTL, TB1CTL_);
#define TB1CCTL0_             0x0402    /* Timer1_B3 Capture/Compare Control 0 */
sfrw(TB1CCTL0, TB1CCTL0_);
#define TB1CCTL1_             0x0404    /* Timer1_B3 Capture/Compare Control 1 */
sfrw(TB1CCTL1, TB1CCTL1_);
#define TB1CCTL2_             0x0406    /* Timer1_B3 Capture/Compare Control 2 */
sfrw(TB1CCTL2, TB1CCTL2_);
#define TB1R_                 0x0410    /* Timer1_B3 */
sfrw(TB1R, TB1R_);
#define TB1CCR0_              0x0412    /* Timer1_B3 Capture/Compare 0 */
sfrw(TB1CCR0, TB1CCR0_);
#define TB1CCR1_              0x0414    /* Timer1_B3 Capture/Compare 1 */
sfrw(TB1CCR1, TB1CCR1_);
#define TB1CCR2_              0x0416    /* Timer1_B3 Capture/Compare 2 */
sfrw(TB1CCR2, TB1CCR2_);
#define TB1IV_                0x042E    /* Timer1_B3 Interrupt Vector Word */
const_sfrw(TB1IV, TB1IV_);
#define TB1EX0_               0x0420    /* Timer1_B3 Expansion Register 0 */
sfrw(TB1EX0, TB1EX0_);

/* Bits are already defined within the Timer0_Ax */

/* TB1IV Definitions */
#define TB1IV_NONE           (0x0000)    /* No Interrupt pending */
#define TB1IV_TBCCR1         (0x0002)    /* TB1CCR1_CCIFG */
#define TB1IV_TBCCR2         (0x0004)    /* TB1CCR2_CCIFG */
#define TB1IV_3              (0x0006)    /* Reserved */
#define TB1IV_4              (0x0008)    /* Reserved */
#define TB1IV_5              (0x000A)    /* Reserved */
#define TB1IV_6              (0x000C)    /* Reserved */
#define TB1IV_TBIFG          (0x000E)    /* TB1IFG */

/* Legacy Defines */
#define TB1IV_TB1CCR1       (0x0002)    /* TB1CCR1_CCIFG */
#define TB1IV_TB1CCR2       (0x0004)    /* TB1CCR2_CCIFG */
#define TB1IV_TB1IFG        (0x000E)    /* TB1IFG */

/************************************************************
* Timer2_B3
************************************************************/
#define __MSP430_HAS_T2B3__            /* Definition to show that Module is available */
#define __MSP430_BASEADDRESS_T2B3__ 0x0440
#define TIMER_B2_BASE __MSP430_BASEADDRESS_T2B3__

#define TB2CTL_               0x0440    /* Timer2_B3 Control */
sfrw(TB2CTL, TB2CTL_);
#define TB2CCTL0_             0x0442    /* Timer2_B3 Capture/Compare Control 0 */
sfrw(TB2CCTL0, TB2CCTL0_);
#define TB2CCTL1_             0x0444    /* Timer2_B3 Capture/Compare Control 1 */
sfrw(TB2CCTL1, TB2CCTL1_);
#define TB2CCTL2_             0x0446    /* Timer2_B3 Capture/Compare Control 2 */
sfrw(TB2CCTL2, TB2CCTL2_);
#define TB2R_                 0x0450    /* Timer2_B3 */
sfrw(TB2R, TB2R_);
#define TB2CCR0_              0x0452    /* Timer2_B3 Capture/Compare 0 */
sfrw(TB2CCR0, TB2CCR0_);
#define TB2CCR1_              0x0454    /* Timer2_B3 Capture/Compare 1 */
sfrw(TB2CCR1, TB2CCR1_);
#define TB2CCR2_              0x0456    /* Timer2_B3 Capture/Compare 2 */
sfrw(TB2CCR2, TB2CCR2_);
#define TB2IV_                0x046E    /* Timer2_B3 Interrupt Vector Word */
const_sfrw(TB2IV, TB2IV_);
#define TB2EX0_               0x0460    /* Timer2_B3 Expansion Register 0 */
sfrw(TB2EX0, TB2EX0_);

/* Bits are already defined within the Timer0_Ax */

/* TB2IV Definitions */
#define TB2IV_NONE           (0x0000)    /* No Interrupt pending */
#define TB2IV_TBCCR1         (0x0002)    /* TB2CCR1_CCIFG */
#define TB2IV_TBCCR2         (0x0004)    /* TB2CCR2_CCIFG */
#define TB2IV_3              (0x0006)    /* Reserved */
#define TB2IV_4              (0x0008)    /* Reserved */
#define TB2IV_5              (0x000A)    /* Reserved */
#define TB2IV_6              (0x000C)    /* Reserved */
#define TB2IV_TBIFG          (0x000E)    /* TB2IFG */

